In [2]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [12]:
arr = [1,2,4,5,8]
pd.Series(arr)

0    1
1    2
2    4
3    5
4    8
dtype: int64

In [17]:
pd.Series(arr , index=['USA','IRAN','ITALY','UAE' , 'CHINA' ])

USA      1
IRAN     2
ITALY    4
UAE      5
CHINA    8
dtype: int64

In [25]:
df = pd.DataFrame(np.random.randn(5,4), index = 'a b c d e'.split(), columns=('USA' , 'IRAN', 'UAE' , 'GERMANI'))

In [26]:
df['NEW_COUNTRY']  = df['USA'] + df['IRAN']

In [32]:
df.drop('NEW_COUNTRY' , axis =1 , inplace=True)

In [33]:
df

        USA      IRAN       UAE   GERMANI
a  0.548601  0.027973 -1.606515  2.715153
b -1.547219  0.367566  0.289800 -1.685093
c -0.386176 -0.580847  0.980690 -0.942255
d  1.046371  0.086104 -1.731841 -0.060978
e  0.331283 -0.300421  0.499245  0.343251

In [34]:
df.loc['d']

USA        1.046371
IRAN       0.086104
UAE       -1.731841
GERMANI   -0.060978
Name: d, dtype: float64

In [35]:
df.iloc[3]

USA        1.046371
IRAN       0.086104
UAE       -1.731841
GERMANI   -0.060978
Name: d, dtype: float64

In [49]:
df[df>0]

        USA      IRAN       UAE   GERMANI
a  0.548601  0.027973       NaN  2.715153
b       NaN  0.367566  0.289800       NaN
c       NaN       NaN  0.980690       NaN
d  1.046371  0.086104       NaN       NaN
e  0.331283       NaN  0.499245  0.343251

In [56]:
df[(df['USA']>0) & (df['UAE']<1)]

        USA      IRAN       UAE   GERMANI
a  0.548601  0.027973 -1.606515  2.715153
d  1.046371  0.086104 -1.731841 -0.060978
e  0.331283 -0.300421  0.499245  0.343251

In [55]:
df[(df['USA']>0) | (df['UAE']<1)]

        USA      IRAN       UAE   GERMANI
a  0.548601  0.027973 -1.606515  2.715153
b -1.547219  0.367566  0.289800 -1.685093
c -0.386176 -0.580847  0.980690 -0.942255
d  1.046371  0.086104 -1.731841 -0.060978
e  0.331283 -0.300421  0.499245  0.343251

In [57]:
df.reset_index()

  index       USA      IRAN       UAE   GERMANI
0     a  0.548601  0.027973 -1.606515  2.715153
1     b -1.547219  0.367566  0.289800 -1.685093
2     c -0.386176 -0.580847  0.980690 -0.942255
3     d  1.046371  0.086104 -1.731841 -0.060978
4     e  0.331283 -0.300421  0.499245  0.343251

In [59]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [60]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [61]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [62]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [65]:
df  = pd.DataFrame(np.random.randn(6,2) , hier_index , 'A B'.split())

In [66]:
df

             A         B
G1 1  1.155219  0.389507
   2  0.646732  0.333161
   3  0.793527  0.107919
G2 1  0.411917 -2.323447
   2  0.048887 -0.231516
   3 -0.436289 -1.757211

In [70]:
df.index.names = ['Groups' , 'Numbers']

In [84]:
df.loc['G1'].loc[1]

A    1.155219
B    0.389507
Name: 1, dtype: float64

In [86]:
df.xs(1 , level='Numbers')

               A         B
Groups
G1      1.155219  0.389507
G2      0.411917 -2.323447

In [96]:
arr2 = [[1,2,np.nan],[3,np.nan,np.nan],[3,4,5], [5,6,7]]
df2 = pd.DataFrame({'A':arr2[0], 'B':arr2[1],'C':arr2[2], 'D':arr2[3]})

In [113]:
df2['A'].fillna(value=df2['A'].mean(), inplace=True)

In [114]:
df2

     A    B  C  D
0  1.0  3.0  3  5
1  2.0  NaN  4  6
2  1.5  NaN  5  7

In [116]:
data = {'Company':'GOOG GOOG MSFT MSFT FB FB'.split(),
       'Person': 'Hossein Sami Fati Sama Ahmad Mali'.split(),
       'Sales': [200, 120,  340, 124 , 243, 360]}
dff = pd.DataFrame(data)

In [117]:
dff

  Company   Person  Sales
0    GOOG  Hossein    200
1    GOOG     Sami    120
2    MSFT     Fati    340
3    MSFT     Sama    124
4      FB    Ahmad    243
5      FB     Mali    360

In [122]:
dff.groupby('Company').std().loc['FB']

Sales    82.731493
Name: FB, dtype: float64

In [125]:
dff.groupby('Company').max()

        Person  Sales
Company
FB        Mali    360
GOOG      Sami    200
MSFT      Sama    340

In [134]:
dff.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  301.5   82.731493  243.0  272.25  301.5  330.75  360.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0